In [1]:
!pip install -U -q PyDrive
from pydrive.auth import GoogleAuth
from pydrive.drive import GoogleDrive
from google.colab import auth
from oauth2client.client import GoogleCredentials

In [3]:
auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

In [4]:
downloaded = drive.CreateFile({'id':'1ksi366OOgzLWB_P_0_fioCjGW8ml5HoP'})
downloaded.GetContentFile('titles.csv')

**importing libraries**

In [5]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
from warnings import filterwarnings
filterwarnings('ignore')

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

**Loading Datasets**

In [7]:
df = pd.read_csv('titles.csv')
df.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [8]:
print("Shape of Title.csv Dataset:",df.shape)

Shape of Title.csv Dataset: (244914, 2)

In [9]:
downloaded = drive.CreateFile({'id':'1b_aczX4naWHkCihcGSDPEUE1J1Sm7qtb'})
downloaded.GetContentFile('cast.csv')

In [10]:
df1 = pd.read_csv('cast.csv')
df1.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [11]:
print("Shape of Cast.csv Dataset:", df1.shape)

Shape of Cast.csv Dataset: (3786176, 6)

**1. How many movies are listed in the titles dataframe?**

In [12]:
len(df)

244914


2. What are the earliest two films listed in the titles dataframe? **bold text**

In [13]:
df.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898


**3. How many movies have the title "Hamlet"?**

In [14]:
len(df[df.title == 'Hamlet'])

20

**4. How many movies are titled "North by Northwest"?**

In [15]:
len(df[df.title == 'North by Northwest'])

1

**5. When was the first movie titled "Hamlet" made?**

In [16]:
df[df.title == 'Hamlet'].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

**6. List all of the "Treasure Island" movies from earliest to most recent.**

In [17]:
df[df.title == 'Treasure Island'].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

**7. How many movies were made in the year 1950?**

In [18]:
len(df[df.year == 1950])

1113

**8. How many movies were made in the year 1960?**

In [19]:
len(df[df.year == 1960])

1549

**9. How many movies were made from 1950 through 1959?**

In [20]:
df[ (df['year'] >=1950) & (df['year']<=1959) ].shape[0]

12934

**10. In what years has a movie titled "Batman" been released?**

In [21]:
df[df.title == 'Batman']

         title  year
39349   Batman  1943
240896  Batman  1989

**11. How many roles were there in the movie "Inception"?**

In [22]:
inception = df1[df1.title == 'Inception']
print('Total Number of Roles in Movie Inception:', len(inception))
print('Unique Roles in Movie Inception:', len(inception.character.unique()))

Total Number of Roles in Movie Inception: 78
Unique Roles in Movie Inception: 56

**12. How many roles in the movie "Inception" are NOT ranked by an "n" value?**

In [24]:

print('Total Number of Roles that are Not ranked in Movie Inception: ',len(inception[inception['n'].isna()]))
print('Unique Roles that are Not ranked in Movie Inception: ', len(inception[inception['n'].isna()].character.unique()))

Total Number of Roles that are Not ranked in Movie Inception:  27
Unique Roles that are Not ranked in Movie Inception:  21

**13. But how many roles in the movie "Inception" did receive an "n" value?**

In [25]:

print('Total Number of Roles that are Not ranked in Movie Inception: ',len(inception[inception['n'].notna()]))
print('Unique Roles that are Not ranked in Movie Inception: ', len(inception[inception['n'].notna()].character.unique()))

Total Number of Roles that are Not ranked in Movie Inception:  51
Unique Roles that are Not ranked in Movie Inception:  36

**14. Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.**

In [26]:
not_na = df1[df1.title == 'North by Northwest'].sort_values('n')
not_na[not_na['n'].notna()]

                      title  year  ...                    character     n
871426   North by Northwest  1959  ...           Roger O. Thornhill   1.0
3518333  North by Northwest  1959  ...                  Eve Kendall   2.0
1457165  North by Northwest  1959  ...              Phillip Vandamm   3.0
3157232  North by Northwest  1959  ...              Clara Thornhill   4.0
356707   North by Northwest  1959  ...                The Professor   5.0
3048272  North by Northwest  1959  ...                Mrs. Townsend   6.0
1695173  North by Northwest  1959  ...              Lester Townsend   7.0
1275337  North by Northwest  1959  ...                      Leonard   8.0
2447081  North by Northwest  1959  ...                     Valerian   9.0
1811387  North by Northwest  1959  ...              Victor Larrabee  10.0
665768   North by Northwest  1959  ...                        Licht  11.0
2295714  North by Northwest  1959  ...                   Auctioneer  12.0
464736   North by Northwest  1959  ...                    Dr. Cross  13.0
1508344  North by Northwest  1959  ...               Sergeant Flamm  14.0
206471   North by Northwest  1959  ...               Captain Junket  15.0
1384780  North by Northwest  1959  ...  Charley - Chicago Policeman  16.0

[16 rows x 6 columns]

**15. Display the entire cast, in "n"-order, of the 1972 film "Sleuth".**

In [27]:
df1[(df1.title == 'Sleuth') & (df1.year == 1972)].sort_values('n')

          title  year  ...                   character    n
1705394  Sleuth  1972  ...                 Andrew Wyke  1.0
326773   Sleuth  1972  ...                 Milo Tindle  2.0
373876   Sleuth  1972  ...           Inspector Doppler  3.0
1465483  Sleuth  1972  ...  Detective Sergeant Tarrant  4.0
2724553  Sleuth  1972  ...             Marguerite Wyke  5.0
1448690  Sleuth  1972  ...      Police Constable Higgs  6.0

[6 rows x 6 columns]

**16. Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".**

In [28]:
df1[(df1.title == 'Sleuth') & (df1.year == 2007)].sort_values('n')

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

**17. How many roles were credited in the silent 1921 version of Hamlet?**

In [29]:
len(df1[(df1.title == 'Hamlet') & (df1.year == 1921)].character)

9

**18. How many roles were credited in Branagh’s 1996 Hamlet**

In [30]:
len(df1[(df1.title == 'Hamlet') & (df1.year == 1996)].character)

54

**19. How many "Hamlet" roles have been listed in all film credits through history?**

In [31]:
len(df1[df1.character == 'Hamlet'])

96

**20. How many people have played an "Ophelia"?**

In [32]:
len(df1[df1.character == 'Ophelia'])

117

**21. How many people have played a role called "The Dude"?**

In [33]:
len(df1[df1.character == 'Dude'])

99

**22. How many people have played a role called "The Stranger"?**

In [34]:
len(df1[df1.character == 'Stranger'])

289

**23. How many roles has Sidney Poitier played throughout his career?**

In [35]:
len(df1[df1.name == 'Sidney Poitier'].character)

43

**24. How many roles has Judi Dench played?**

In [36]:
len(df1[df1.name == 'Judi Dench'].character)

55

**25. List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.**

In [37]:
print("Supporting Roles played by Cary Grant in the 1940s :")
carry = df1[(df1.name == 'Cary Grant') & ((df1.year >= 1940) & (df1.year <= 1950)) & (df1.n == 2 )].sort_values('year')
carry[['year','character']]

Supporting Roles played by Cary Grant in the 1940s :

        year    character
871423  1940   Nick Arden
871433  1941  Roger Adams

**26. List the leading roles that Cary Grant played in the 1940s in order by year.**

In [38]:
print("Leading Roles played by Cary Grant in the 1940s :")
carry = df1[(df1.name == 'Cary Grant') & ((df1.year >= 1940) & (df1.year < 1950)) & (df1.n == 1 )].sort_values('year')
carry[['year','character']]

Leading Roles played by Cary Grant in the 1940s :

        year                             character
871448  1940                           Matt Howard
871407  1940                          Walter Burns
871450  1940                    C. K. Dexter Haven
871438  1941                      Johnnie Aysgarth
871452  1942                          Leopold Dilg
871429  1942                 Patrick 'Pat' O'Toole
871398  1943                         Capt. Cassidy
871422  1943  Joe Adams -posing as Joe Bascopolous
871430  1944                           Jerry Flynn
871390  1944                     Mortimer Brewster
871425  1944                            Ernie Mott
871424  1946                           Cole Porter
871427  1946                                Devlin
871444  1947                           Dick Nugent
871445  1947                                Dudley
871421  1948                         Jim Blandings
871402  1948                     Dr. Madison Brown
871411  1949                 Captain Henri Rochard

**27. How many roles were available for actors in the 1950s?**

In [39]:
len(df1[(df1.type == 'actor') & ((df1.year >= 1950) & (df1.year <= 1960)) ].character)

171302

**28. How many roles were available for actresses in the 1950s?**

In [40]:
len(df1[(df1.type == 'actress') & ((df1.year >= 1950) & (df1.year <= 1960)) ].character)

63333

**29. How many leading roles (n=1) were available from the beginning of film history through 1980?**

In [41]:
len(df1[ (df1.n == 1) & (df1.year <= 1980) ].character)

65140

**30. How many non-leading roles were available through from the beginning of film history through 1980?**

In [42]:
len(df1[ (df1.n > 2) & (df1.year <= 1980) ].character)

607925

**31. How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?**

In [43]:
len( df1[ (df1['n'].isna() ) & (df1.year <= 1980) ].character )

448347